{
  "industrialRevolution": {
    "title": "Промышленная Революция: Мастерская Мира",
    "shortDesc": "Исследуйте взрывное развитие фабрик, паровых машин и железных дорог, которые навсегда изменили ландшафт Британии...",
    "fullText": "<p>Викторианская Англия стала колыбелью Промышленной революции, изменившей мир навсегда. От паровых машин и угольных станков до ткацких станков и металлургических заводов, Британия превратилась в глобальный производственный центр. Эти инновации привели к появлению новых городов, таких как Манчестер и Бирмингем, а также к невиданному росту населения и появлению новых социальных классов.</p><p>Однако за прогрессом скрывались и трудности: ужасные условия труда, детский труд, загрязнение окружающей среды и резкое расслоение общества. Изучение этой темы позволяет понять двойственную природу прогресса и его долгосрочные последствия для человечества.</p><p>Мы предлагаем вам интерактивные карты промышленных зон того времени, архивные фотографии фабрик и уникальные свидетельства рабочих, чтобы вы могли ощутить всю мощь и противоречия этой революции.</p>",
    "image": "images/promish.jpg",
    "buttonText": "Заглянуть в цеха"
  },
  "societyAndMorals": {
    "title": "Общество и Мораль: Две Стороны Медали",
    "shortDesc": "Погрузитесь в сложные социальные структуры, строгие правила этикета, феномен 'двойной морали'...",
    "fullText": "<p>Викторианское общество было невероятно сложным и противоречивым. С одной стороны, существовали строгие викторианские моральные кодексы, акцент на семье, благопристойности и религиозности. С другой — процветали трущобы, преступность, проституция и неравенство. Классовая структура была жесткой: от аристократии до рабочего класса и бесправных бедняков.</p><p>Изучите роль женщины в викторианском обществе, влияние церкви, развитие образования и зарождение движений за социальную справедливость. Мы собрали уникальные дневники и мемуары современников, чтобы вы могли увидеть этот мир их глазами.</p><p>Поймите, как формировались идеи благотворительности, как развивалась система здравоохранения, и как викторианская эпоха заложила основы для будущих социальных реформ.</p>",
    "image": "images/moral.jpg",
    "buttonText": "Раскрыть секреты"
  },
  "britishEmpire": {
    "title": "Британская Империя: Солнце не Заходит",
    "shortDesc": "Познакомьтесь с масштабами и влиянием колониальной политики, торговыми путями и военными кампаниями...",
    "fullText": "<p>К концу викторианской эпохи Британская империя охватывала четверть суши Земли и управляла четвертью мирового населения. Эта тема посвящена колониальной экспансии, её экономическим и политическим причинам, а также влиянию на метрополию и колонизированные народы.</p><p>Вы узнаете о ключевых фигурах колониализма, значимых событиях, таких как Индийское восстание, и о том, как торговые пути и военные кампании формировали глобальный порядок. Мы предлагаем доступ к архивным картам, документам и пропагандистским материалам, чтобы вы могли критически оценить феномен имперской власти.</p><p>Изучите, как империя влияла на британскую идентичность, культуру и экономику, а также о наследии, которое она оставила в современном мире.</p>",
    "image": "images/empire.jpg",
    "buttonText": "На карты мира"
  },
  "scienceAndDiscoveries": {
    "title": "Наука и Открытия: Шаг в Будущее",
    "shortDesc": "От революционных теорий Дарвина до первых телеграфов и электрических изобретений — золотой век для науки...",
    "fullText": "<p>Викторианская эпоха была золотым веком научных и технологических открытий. Это время Чарльза Дарвина и его теории эволюции, которая потрясла основы мировоззрения. Это эпоха первых электрических лампочек, телеграфа, телефона и фотографии, которые кардинально изменили общение и образ жизни.</p><p>Исследуйте прорывы в медицине (асептика Листера), инженерии (мосты и тоннели Брюнеля), астрономии и химии. Узнайте, как эти открытия влияли на повседневную жизнь, промышленность и военное дело, закладывая фундамент для научно-технического прогресса XX века. Мы предоставим доступ к оригинальным чертежам, научным статьям и биографиям великих викторианских ученых.</p><p>Прикоснитесь к умам, которые формировали современное понимание мира и закладывали основы будущих инноваций.</p>",
    "image": "images/science.jpg",
    "buttonText": "Узнать новое"
  },
  "artAndLiterature": {
    "title": "Искусство и Литература: Расцвет Талантов",
    "shortDesc": "Познакомьтесь с творчеством Диккенса, Бронте, Оскара Уайльда, а также с развитием прерафаэлитизма...",
    "fullText": "<p>Культурный расцвет викторианской эпохи породил таких гигантов литературы, как Чарльз Диккенс, сестры Бронте, Джордж Элиот, Томас Гарди и Оскар Уайльд. Их произведения отражали и формировали викторианское общество, исследуя его социальные проблемы, моральные дилеммы и человеческую душу.</p><p>В искусстве процветали такие направления, как прерафаэлитизм, символизм, а позже и эстетизм, бросавшие вызов устоявшимся канонам. Музыка, театр и фотография также переживали бурный рост. Мы предоставим доступ к полным текстам произведений, галереям картин высокого разрешения и аудиозаписям лекций по викторианской культуре.</p><p>Погрузитесь в мир викторианской фантазии, драмы и красоты, которая продолжает вдохновлять и по сей день.</p>",
    "image": "images/art.jpg",
    "buttonText": "Открыть шедевры"
  },
  "architectureAndCity": {
    "title": "Архитектура и Городская Жизнь: Преображение Пространства",
    "shortDesc": "Как британские города преобразились, строя величественные вокзалы, музеи и первое в мире метро...",
    "fullText": "<p>Викторианская эпоха кардинально изменила облик британских городов. Бурный рост населения и промышленности привел к строительному буму: от величественных вокзалов и музеев до обширных жилых районов. Стиль неоготики стал доминирующим, подарив миру такие шедевры, как Вестминстерский дворец.</p><p>Одновременно решались проблемы санитарии, водоснабжения и транспорта, что привело к созданию первых современных канализационных систем, водопроводов и появлению метро. Узнайте о проектах, таких как Кристалл-Палас, и о том, как городские планировщики пытались совладать с вызовами быстро урбанизирующегося общества. Мы предлагаем 3D-модели зданий, старые карты городов и эскизы архитектурных проектов.</p><p>Проследите, как из средневековых поселений вырастали мегаполисы, знакомые нам сегодня.</p>",
    "image": "images/england.jpg",
    "buttonText": "Исследовать улицы"
  }
}